/*
1.დაბეჭდე 1-დან 30-მდე ყველა ლუწი რიცხვი.
2.დაბეჭდე 50-დან 20-მდე ყველა კენტი რიცხვი.
3.დაბეჭდე 1-დან 100-მდე ყველა რიცხვი, რომელიც 5-ზე იყოფა უნაშთოდ.
4.დაბეჭდე 80-დან 40-მდე ყველა რიცხვი, რომელიც 3-ზე იყოფა უნაშთოდ.
5.დაბეჭდე 1-დან 60-მდე ყველა რიცხვი, რომელიც ერთდროულად იყოფა 2-ზე და 3-ზე.
*/
//1
console.log("დავალება 1")
for(let i = 1; i <=30; i++){
    console.log(i)
}
//2
console.log("დავალება 2")
for(let b = 50; b >= 20; b--){
    console.log(b)
}
//3
console.log("დავალება 3")
for(let a = 1; a <=100; a++){
    if(a%5==0){
        console.log(a)
    }
}
//4
console.log("დავალება 4")
for(let c = 80; c >=40; c--){
    if(c%3==0){
        console.log(c)
    }
}
//5
console.log("დავალება 5")
for(let d = 1; d<=60; d++){
    if(d%2==0 || d%3==0){
        console.log(d)
    }
}