//1) დაბეჭდე 50-დან 40-მდე ყველა კენტი რიცხვი.
for(let a = 50; a >=40; a--){
    console.log(a)
}
//2) დაბეჭდე 1-დან 20-მდე ყველა რიცხვი, რომელიც იყოფა 3-ზე.
for(let b = 1; b <=20; b++){
    if(b%3==0){
        console.log(b)
    }
}
//3) დაბეჭდე 100-დან 90-მდე ყველა ლუწი რიცხვი.
for(let c =100; c>90; c--){
    if(c%2==0){
        console.log(c)
    }
}
//4) დაბეჭდე 10-დან 30-მდე ყველა რიცხვი, რომელიც იყოფა 5-ზე.
for(let d =10; d<30; d++){
    if(d%5==0){
        console.log(d)
    }
}
//5) დაბეჭდე 60-დან 40-მდე ყველა რიცხვი, რომელიც არ იყოფა 2-ზე.
for(let e =60; e>40; e--){
    if(e/2!=0){
        console.log(e)
    }
}
//6) დაბეჭდე 1-დან 50-მდე ყველა რიცხვი, რომელიც იყოფა 3-ზე და 5-ზე ერთდროულად.
for(let f = 1; f<50; f++){
    if (f%3==0||f%5==0){
        console.log(f)
    }
}
//7) დაბეჭდე 25-დან 10-მდე ყველა ლუწი რიცხვი.
for (let g = 25; g >10; g--){
    if (g%2==0){
        console.log(g)
    }
}
//8) დაბეჭდე 1-დან 100-მდე ყველა რიცხვი, რომელიც მთავრდება 7-ით.
for (let h = 1; h<100; h++){
    if(h){
        console.log(h)
    }
}
//9) დაბეჭდე 200-დან 180-მდე ყველა რიცხვი, რომელიც იყოფა 4-ზე.
for (let v =200; v>180; v--){
    if (v%4==0){
        console.log(v)
    }
}
//10) დაბეჭდე 15-დან 45-მდე ყველა კენტი რიცხვი, რომელიც მეტია 30-ზე.
for (let z = 15; z<45; z++){
    if (z%2==0 || z>30){
        console.log(z)
    }
}
