/*
1.დაბეჭდე 1-დან 30-მდე ყველა ლუწი რიცხვი.
2.დაბეჭდე 50-დან 20-მდე ყველა კენტი რიცხვი.
3.დაბეჭდე 1-დან 100-მდე ყველა რიცხვი, რომელიც 5-ზე იყოფა უნაშთოდ.
4.დაბეჭდე 80-დან 40-მდე ყველა რიცხვი, რომელიც 3-ზე იყოფა უნაშთოდ.
5.დაბეჭდე 1-დან 60-მდე ყველა რიცხვი, რომელიც ერთდროულად იყოფა 2-ზე და 3-ზე.
*/
//1
console.log("დავალება 1")
for(let i = 1; i<=30;i++){
    if(i%2==0){
        console.log(i)
    }
}
//2
console.log("დავალება 2")
for(let i = 50; i>=20;i++){
    if(i%2==1){
        console.log(i)
    }
}
//3
console.log("დავალება 3")
for(let i = 1;i<=100;i++){
    if(i%5==0){
        console.log(i)
    }
}
//4
console.log("დავალება 4")
for(let i = 80; i>=40;i--){
    if(i%3==0){
        console.log(i)
    }
}
//5
console.log("დავალება 5")
for(let i = 1; i>=60;i++){
    if(i%2==0||i%3==0){
        console.log(i)
    }
}